# Pictures:
GREETING_PICTURE = 'hey_pic.png'
FLASHCARD_PICTURE = 'biffer.png'

# Messages:
CANCEL_MESSAGE = 'Тренировка отменена'
GREETING_MESSAGE = 'Меня зовут Ханью, я твой помощник в изучении китайского'
CHOOSE_HSK_LEVEL_MSG = 'Выбери уровень подготовки'
INTRODUCING_MSG = 'Для начала давай определимся с некоторыми моментами!'
START_TRAINING_MESSAGE = 'Приступим!'
LETS_START_MESSAGE = 'Ну что же, приступим!'
HELP_MESSAGE = 'Это бот-помощник в изучении китайского языка.'
INSTRUCTIONS_MESSAGE = 'Чтобы начать отправьте /start.'
WELCOME_MSG = 'Добро пожаловать в игру!'
STARTOVER_MESSAGE = 'Начнем сначала!'
CHOOSE_LANGUAGE_MSG = 'Выбери язык, на котором будет удобно общаться'
CHOOSE_ANSWER_MSG = 'Пожалуйста, выберите ответ.'
GOOD_JOB_MSG = 'Отлично! Тренировка окончена.'
GAME_OVER_MSG = 'Игра окончена!'
QUIZ_RULES = '''
    Правила:
    Вам будет предложено ответить на 10 вопросов.
    На каждый вопрос дается четыре варианта ответа.
    Ваша задача выбрать правильный.

    Для того, чтобы выйти из тренировки нажмите кнопку "🚫 Выход".
    Для того, чтобы вернуться к предыдущему вопросу нажмите кнопку "🔙 Назад".
    '''
FLASHCARDS_RULES = '''
    Правила:
    Вам будет предложено слово на китайском языке.
    Если вы знаете перевод, то нажимайте кнопку "✅".
    Если вы не знаете перевод, то нажимайте кнопку "❌".

    Если захотите получить подсказку, то просто нажмите кнопку со словом.
    Для того, чтобы закончить тренировку нажмите кнопку "🚫 Выход".

    Отвечайте честно, ведь я знаю все правильные ответы 🤓
    '''

# buttons:
HSK_1_BUTTON = 'hsk_buttons_1'
CANCEL_QUIZ_BTN = '🔙 Назад'
EXIT_QUIZ_BTN = '🚫 Выход'
