# Pictures:
GREETING_PICTURE = 'hey_pic.png'

# Messages:
CANCEL_MESSAGE = 'Тренировка отменена'
START_TRAINING_MESSAGE = 'Приступим к тренировке!'
WELCOME_MSG = 'Добро пожаловать в игру!'
CHOOSE_ANSWER_MSG = 'Пожалуйста, выберите ответ.'
GOOD_JOB_MSG = 'Отлично! Тренировка окончена.'
GAME_OVER_MSG = 'Игра окончена!'
QUIZ_RULES = '''
    Правила:
    Вам будет предложено ответить на 10 вопросов.
    На каждый вопрос дается четыре варианта ответа.
    Ваша задача выбрать правильный.

    Для того, чтобы выйти из тренировки нажмите кнопку "🚫 Выход".
    Для того, чтобы вкрнуться к предыдущему вопросу нажмите кнопку "🔙 Назад".
    '''
FLASHCARDS_RULES = '''
    Правила:
    Вам будет предложено слово на китайском языке.
    Если вы знаете перевод, то нажимайте кнопку "✅".
    Если вы не знаете перевод, то нажимайте кнопку "❌".

    Если захотите получить подсказку, то просто нажмите кнопку со словом.
    Для того, чтобы закончить тренировку нажмите кнопку "🚫 Выход".

    Отвечайте честно, ведь я знаю все правильные ответы 🤓
    '''

# buttons:
HSK_1_BUTTON = 'hsk_buttons_1'
CANCEL_QUIZ_BTN = '🔙 Назад'
EXIT_QUIZ_BTN = '🚫 Выход'
